# Books (Core)

Database ERD

 ![png](Books.png)

In [1]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:cleoPat4!@localhost/books"

In [2]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [3]:
# Create engine
engine = create_engine(connection)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [5]:
database_exists(connection)

True

Import cvs files as dataframes and add as tables to database

In [6]:
import pandas as pd
df_users = pd.read_csv('data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
df_users.to_sql('users', engine, if_exists = 'replace')

3

In [8]:
q = """SELECT * FROM users LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

In [9]:
import pandas as pd
df_favorites = pd.read_csv('data/favorites.csv')
df_favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
df_favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [11]:
q = """SELECT * FROM favorites LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

In [12]:
import pandas as pd
df_titles = pd.read_csv('data/titles.csv')
df_titles.to_sql('titles', engine, if_exists = 'replace')
q = """SELECT * FROM titles LIMIT 5;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

In [13]:
df_titles.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [14]:
import pandas as pd
df_authors = pd.read_csv('data/authors.csv')
df_authors.to_sql('authors', engine, if_exists = 'replace')
q = """SELECT * FROM authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [15]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1       favorites
2          titles
3           users

In [16]:
q = """
SELECT titles.title, favorites.user_id
FROM titles
JOIN favorites ON titles.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1